"""角度を扱う際にはベクトルの知識が重要になる
ここでは基本的なベクトル操作および、それによる条件判定、角度変換などについてまとめる"""

# 1.内積・外積の求め方
# 内積・外積の幾何的なイメージについては省略する。忘れた場合はしらべてから以下を読む方がよい。
# ベクトルa, ベクトルbのなす角をθとする


# 内積
# |a||b|cosθ
def dot(a: tuple[int, int], b: tuple[int, int]):
    return a[0] * b[0] + a[1] * b[1]


# 外積
# |a||b|sinθ
def cross(a: tuple[int, int], b: tuple[int, int]):
    return a[0] * b[1] - a[1] * b[0]


# 2. 内積・外積の符号による角度判定
# 内積の符号はcosθに一致し、外積の符号はsinθに一致することさえわかっていれば問題ない
# あくまで"符号"であり、値は-1<= y <=1の範囲では無いため一致しないことに注意すること
# 主に二つのベクトルのなす角180度以上となったかなどの判定に使うことが多いだろう。
# この例であれば、外積<0または外積=0かつ内積<0、180 <= x < 360の範囲に入ったとわかる


# 3. 角度計算
# 二つのベクトルのなす角度を求めたいケースがままある。この場合有用なのはtanの利用である。
# arcsin, arccos などでは定義域が-1 <= y <= 1となるため、境界付近の値が丸め込まれ変換に適さない
# arctan であれば定義域は全ての実数であるため、丸め込みなしに変換が可能となる

# さて、通常のarctanであれば傾きを引数としてとるため、なす角がx, x+180のどちらなのか判別できない
# ここで有用なのがmath.atan2である。 atan2(y, x) は、座標(x, y)のベクトルがx軸の正方向となす角度を求める。
# そのため360度の範囲で判別可能である
# 具体的には、aベクトルとx軸のなす角をθとすれば、(|a|sinθ,|a|cosθ)を引数とする
from math import atan2, degrees

a = (0, 1)
theta = degrees(atan2(1, 0))
print(theta)
# > 90.0

# より一般的にベクトルaとベクトルbがなす角を求めたいとする二つのベクトルのなす角をθとする。
# 簡単のため、a,bをaをx軸の正方向とする座標系に回転させた物として議論する。
# x=|b|cosθ,y = |b|sinθ　をatan2に代入すればよい
# この値を直接求めることは難しいが、|a||b|cosθ,|a||b|sinθはそれぞれ内積・外積であるため容易に計算可能である
# ここでこれらの値をの関係に着目すると、(|a||b|cosθ,|a||b|sinθ)はbベクトルの大きさを|a|倍したベクトルであり、
# aベクトルと成す角度が等しいことに気づく。すなわち角度を求めるという目的においては、この値を直接用いることができる
a = (0, 1)
b = (1, -1)

# 小さい方のなす角（0〜180度）
theta = degrees(atan2(abs(cross(a, b)), dot(a, b)))
print(theta)
# >135.0

# aからbへの反時計回りの角度（0〜360度）
theta = degrees(atan2(cross(a, b), dot(a, b))) % 360
print(theta)
# > 225.0


# 4. その他特殊判定
# 内積・外積の定義を理解していれば十分に理解可能だろう

# 直交
dot(a, b) == 0

# 平行（同方向または逆方向）
cross(a, b) == 0

# 同方向
cross(a, b) == 0 and dot(a, b) > 0

# 逆方向
cross(a, b) == 0 and dot(a, b) < 0

# bがaの反時計回り側（左側）にある
cross(a, b) > 0
