"""
ある配列に対して、[l,r)に+kする処理を繰り返すとする。
このとき、前の要素に対する差分を保存しておくことで、最終的に累積和をとれば各値の変化が復元できる
差分配列を元に戻したときは末尾に不要な要素がある。仕組み上自明だが、一応注意。
元の配列が有る場合は、これを差分配列に変換してから使えばよい
"""

from itertools import accumulate

N = 10
diff = [0] * (N + 1)

# [4,7)に+2
diff[4] += 2
diff[7] -= 2

# [1,5) に+3
diff[1] += 3
diff[5] -= 3

print(list(accumulate(diff)))
# [0, 3, 3, 3, 5, 2, 2, 0, 0, 0, 0]

A = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
diff = [A[0]] + [A[i] - A[i - 1] for i in range(1, N)] + [0]
# [4,7)に+2
diff[4] += 2
diff[7] -= 2

# [1,5) に+3
diff[1] += 3
diff[5] -= 3
print(list(accumulate(diff)))
# [0, 4, 5, 6, 9, 7, 8, 7, 8, 9, 9]
