"""
マンハッタン距離はA(x,y)に対して|x|+|y|と定義される距離である
マンハッタン距離の扱いにおいては、数式による変換がなによりも効率的である
（効率的なだけで、幾何的にイメージがたやすいわけではない）
"""

# ある点からのマンハッタン距離の総和そ最小化する場合
# 各軸の中央値が目的の値である
# 幾何的にはx軸方向とy軸方向を分離し、各軸方向についてある点からその他の点へ向かう矢印をかくと、
# その本数の増減によりイメージ出来るだろう
"""
Σ(|x-x_i| + |y-y_i|) 
= Σ(|x-x_i|) + Σ(|y-y_i|)
"""

# ある点からのマンハッタン距離が最大である点を求める場合
"""
愚直な方針としては
|x - x_i| + |y - y_i|を全ての点についてマンハッタン距離を求めれば良いが、高速では無い
マンハッタン距離について式変形を行う
|x| + |y| 
= max(x, -x) + max(y, -y)
= max(x+y, x-y, -x+y, -x-y)
= max(u, v, -v, -u)  (u = x+y, v = x-y)
= max(|u|,|v|)

このように式変形することで、マンハッタン距離|x|+|y|を最大化する問題は、絶対値を含む最大化問題だったものが、
絶対値を含まない2つの値u,vを最大化する問題へと変化する。
x,yがそれぞれ2点間の座標の値の差であるため、u,vは座標の値より求められる値の差である。
各点におけるu,vの値は事前に計算可能なので、u,vを最大化するには最大及び最小の値のみ考慮すれば十分である

よりわかりやすくすると、x = x-x_i, y = y-y_iとして、
|x - x_i| + |y - y_i|
= max(|x-x_i + y-y_i|, |x-x_i - (y-y_i)|)
= max(|x+y - (x_i+y_i)|, |x-y - (x_i-y_i)|)
= max(|u-u_i|,|v-v_i|) 
となる

"""

# チェビシェフ距離とは
"""
各軸の座標差の絶対値の最大値で定義される距離を「チェビシェフ距離」という。
すなわち次のように表される
max(|x|,|y|,...)
最大である点を求める式変形では、座標変換(u = x+y, v = x-y)により、
マンハッタン距離をチェビシェフ距離に変換したといえる
チェビシェフ距離の最大化は各軸の最大・最小値のみで解けるため、
この変換はマンハッタン距離の最大化を考える上で都合がよい

"""

# 幾何的な視点
"""
原点からみて同じマンハッタン距離である点を結んだ菱形を考える。
この菱形を時計回りに45度回転し、√2倍するという操作が上記の式変形に一致する。
"""
